src/Documents/НачислениеОплатыЗаОбучение/НачислениеОплатыЗаОбучение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеОплатыЗаОбучение</name>
  <registerRecords>AccumulationRegister.ОстаткиНачисленийСтудентов</registerRecords>
  <registerRecords>InformationRegister.РегистрОпераций</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Льгота</name>
    <type>
      <types>CatalogRef.Льготы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНачисления</name>
    <type>
      <types>CatalogRef.ДополнительныеНачисления</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗачисленнойОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьНачислениеОплаты</name>
  </tabularSections>
</mdclass:Document>

src/Documents/НачислениеОплатыЗаОбучение/Forms/ФормаНачисленияОплаты/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьМножительЛьготыНаСервере(СсылкаНаЛьготу)
   Возврат СсылкаНаЛьготу.МножительЛьготы;
КонецФункции  

&НаСервереБезКонтекста
Функция ПолучитьДополнительныеНачисленияНаСервере(СсылкаДополнительныеНачисления)
   Возврат СсылкаДополнительныеНачисления.Сумма;
КонецФункции

&НаКлиенте
Процедура РассчитатьСумму(Объект) Экспорт
	МножительЛьготы = 0.0;
	ДопНач = 0.0;
	Если не Объект.Льгота.Пустая() Тогда
		МножительЛьготы = ПолучитьМножительЛьготыНаСервере(Объект.Льгота);
	КонецЕсли;
	Если не Объект.ДополнительныеНачисления.Пустая() Тогда
		ДопНач = ПолучитьДополнительныеНачисленияНаСервере(Объект.ДополнительныеНачисления);
	КонецЕсли;
	Объект.СуммаЗачисленнойОплаты = Объект.Ставка - (Объект.Ставка * МножительЛьготы)  + ДопНач;
КонецПроцедуры

&НаКлиенте
Процедура СтавкаПриИзменении()
	РассчитатьСумму(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЛьготаПриИзменении(Элемент)
	РассчитатьСумму(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеНачисленияПриИзменении(Элемент)
	РассчитатьСумму(Объект);
КонецПроцедуры
